'use strict'

/*
2010:
1. 10 + 10 = 20
2. 20 + "10" == "20" + "10"
*/
console.log(10 + 10 + "10");

/*
101010:
1. 10 + "10" == "10" + "10" == "1010"
2. "1010" + 10 == "1010" + "10" == "101010"
*/
console.log(10 + "10" + 10);

/*
30:
1. +"10" == 10 (более высокий приоритет, чем сложение)
2. 10 + 10 + 10 == 30
*/
console.log(10 + 10 + +"10");

/*
-Infinity:
1. -"" == -0 (более высокий приоритет, чем деление)
2. 10 / -0 == -Infinity
*/
console.log(10 / -"");

/*
NaN:
1. +"2,5" == NaN (более высокий приоритет, чем деление)
2. 10 / NaN == NaN
*/
console.log(10 / +"2,5");

